package homework;

public class homework0318 {
/*
 * 3월 18일 숙제(1)
 * 다음과 같은 멤버변수와 멤버메소드를 갖는 Student 클래스를 정의하시오
  멤버변수 - 학생이름, 반, 번호, 국어점수, 영어점수, 수학점수
  멤버메소드 - 객체의 국어, 영어, 수학점수를 모두 더해서 총점을 반환하는 메소드
              총점을 과목수로 나눈 평균을 반환하는 메소드
              학생이름, 반, 번호, 국어점수, 영어점수, 수학점수, 총점, 평균을 화면에 출력하는 메소드
StudentDemo 클래스를 정의하고 아래의 내용을 구현하시오
  학생정보를 여러 개 저장할 수 있는 배열을 생성하시오.
  학생정보를 조회, 검색, 입력, 종료하는 메뉴를 제공하시오.
  조회메뉴를 선택하면
    학생이름  반  번호  국어점수  영어점수  수학점수  총점  평균 을 화면에 출력하시오
    ========================================================
  검색메뉴를 선택하면
    이름을 입력받아서 이름과 일치하는 학생을 정보를 화면에 출력하시오
    학생정보 출력시 멤버메소드 중에서 출력기능을 활용하시오.
  입력메뉴를 선택하면
    학생이름, 반, 번호, 국어점수, 영어점수, 수학점수를 입력받아서 Student 객체에 저장하시오.
  종료메뉴를 선택하면
    반복문을 탈출해서 프로그램을 종료하시오
 */
}
