package temp001;

public class ObjectQuiz {
	
	// 1. 학생 정보를 담는 새 클래스 만들기
	// 학생 정보 : 학생 이름, 학생 전화번호, 학생 이메일, 학번(숫자로만 구성), 생년월일
	// 정보는 private로 만들고, getter, setter 메소드 만들기
	
	// 2. 만들어진 학생 정보 클래스를 불러와서 객체를 만들고 구체적인 정보 담기
	// 학생 정보 (1) 홍길동, 010-1234-5678, hong@hong.ac.kr, 190141, 1995/05/10
	// 학생 정보 (2) 임꺽정, 010-1111-2222, lim@lim.ac.kr, 190142, 1995/06/23
	// 학생 정보 (3) 장길산, 010-2222-3333, jang@jang.ac.kr, 190244, 1994/07/06
	
	// 3. 학생 객체에 저장된 정보 꺼내기
	// 아래와 같은 형태로 학생 정보를 출력하시오 (println 사용)
	// ==============================================================
	// 이름      전화번호               이메일                       학번          생년월일
	// ==============================================================
	// 홍길동    010-1234-5678  hong@hong.ac.kr    190141    1995/05/10
	// 임꺽정    이름 외의 나머지 정보는 그냥 입력하기 귀찮아서 생략함
	// 장길산   
	
	// 4. 홍길동의 생일을 1995/03/10으로 수정하기
	// 5. 모든 학생의 이메일 주소에서 @ 이하를 korea.ac.kr로 바꾸기
	// 6. 학번이 1901로 시작하는 학생은 국어교육과, 1902로 시작하는 학생은 영어교육과라는 정보를 덧붙여서 다시 모든 학생 정보를 출력하기
	// ======================================================================
	// 이름      전화번호               이메일                       학번          생년월일	     	학과명
	// ======================================================================
	
}
